### 구글드라이브 연동

In [ ]:
# 구글드라이브 연동
from google.colab import drive
drive.mount('/gdrive', force_remount=True)

# 구글 드라이브 파일 확인
!ls '/gdrive/My Drive/temp/'

# 반복되는 드라이브 경로 변수화
drive_path = '/gdrive/My Drive/temp/'

Mounted at /gdrive
 매수종목1.txt		   lenna.png		   score.csv
 매수종목2.txt		   little-char.png	   sonar.csv
 adult.data		   ml_class.png		   stock-data.csv
 auto-mpg.csv		   pca_1.png		  'stock price.xlsx'
 bmi_500.csv		   pca_2.png		  'stock valuation.xlsx'
 citibike.csv		   pca_3.png		   test.db.db
 매수종목.csv		   Picture1.png		   test.txt
 data_mine.csv		   population_number.csv   ThoraricSurgery.csv
 data_population.csv	   ram_price.csv	   titanic.xls
 data_studentlist_en.csv   ratings_small.txt	   tmdb_5000_credits.csv
 demo.docx		   ratings_test.txt	   tmdb_5000_movies.csv
 diabetes.csv		   ratings_train.txt	   Traffic_Accident_2017.csv
 example.docx		   sample1.pdf		   train.csv
 height_weight.txt	   sample2.pdf		   user_id_mean.csv
'Hello World.xlsx'	   sample.docx		   wine.csv
 HelloWorld.xlsx	   sample_merge.pdf	   주가데이터.xlsx
 house_price.csv	   sample.xlsx		   남북한발전전력량.xlsx

# Pandas
데이터 핸들링

## Pandas 기초
Pandas 모듈
- Series Class : 1차원
 - 인덱스(index) + 값(value)
- DataFrame Class : 2차원
 - 표와 같은 형태

In [ ]:
import pandas as pd

### Series

In [ ]:
se = pd.Series( [4, 7, -5, 3] )
se

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
s = pd.Series( [4, 7, -5, 3], index = ['d', 'b', 'a', 'c'] )
s

d    4
b    7
a   -5
c    3
dtype: int64

In [ ]:
# 값 확인
# 인덱스 확인
# 타입 확인

print(s.values)
print(s.index)
print(s.dtype)

[ 4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')
int64

#### Pandas 연습 01
각 도시의 2015년 인구 데이터를 시리즈로 만드시오.
```
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
```

In [ ]:
p = pd.Series( [9904312, 3448737, 2890451, 2466052], 
              index = ['서울', '부산', '인천', '대구'] )
p

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

#### Series

In [ ]:
p.name = '인구'
p.index.name = 'city'
p

city
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
# 연산
p / 1000000

city
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [ ]:
# 인덱스

p[0], p[1], p['대구']

(9904312, 3448737, 2466052)

In [ ]:
# 슬라이싱

p[1:3], p['부산' : '인천']

(city
 부산    3448737
 인천    2890451
 Name: 인구, dtype: int64, city
 부산    3448737
 인천    2890451
 Name: 인구, dtype: int64)

In [ ]:
# 팬시

p[ [0, 3, 1] ], p[ ['서울', '대구', '부산'] ]

(city
 서울    9904312
 대구    2466052
 부산    3448737
 Name: 인구, dtype: int64, city
 서울    9904312
 대구    2466052
 부산    3448737
 Name: 인구, dtype: int64)

In [ ]:
# Boolean 인덱싱
# 인구 250만 이상 도시

p [p >= 2500000]

city
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [ ]:
# 인구 500만 이하 도시

p [ p <= 5000000]

city
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
# 인구 250만 이상 500만 이하 도시

p [ (p >= 2500000) & (p <= 5000000) ]

city
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [ ]:
# 또는

p [ p >= 2500000 ] [ p <= 5000000 ]

city
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [ ]:
# 딕셔너리 객체로 시리즈 생성

data = {'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}
p2 = pd.Series(data)
p2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [ ]:
# 2015년도와 2010년도의 인구 증가율 계산

ds = p - p2
ds[ ds.notnull() ] # <-> isnull()

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
# 2015년도와 2010년도의 인구 증가율(%) 계산

rs = (p - p2) / p2 * 100
rs [ rs.notnull() ]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [ ]:
rs['대구'] = 1.41 # 데이터 변경
del rs['서울'] # 데이터 삭제
rs

대구    1.410000
대전         NaN
부산    1.636984
인천    9.818107
dtype: float64

### DataFrame

In [ ]:
# DataFrame 생성
data = {"2015": [9904312, 3448737, 2890451, 2466052],
        "2010": [9631482, 3393191, 2632035, 2431774]}

df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [ ]:
# 2015년도와 2010년도의 인구 증가율(%) 계산

SyntaxError: ignored

In [ ]:
# DataFrame 인덱스 확인

df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# DataFrame 인덱스 수정
df.index = ['서울', '부산', '인천', '대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [ ]:
# DataFrame 인덱스 지정하여 생성
data = [[9904312, 3448737, 2890451, 2466052],
        [9631482, 3393191, 2632035, 2431774]]
ind = ['2015', '2010']
col = ['서울','부산','인천','대구']

df2 = pd.DataFrame(data, index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [ ]:
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

#### Pandas 연습 02
DataFrame을 이용하여 아래와 같은 결과를 구성하시오.

| |홍길동|	김사또|	임꺽정|
|---|---|---|---|
|키|	175.3|	180.2|	178.6|
|몸무게|	66.2|	78.9|	55.1|
|나이|	27.0|	49.0|	35.0|

In [ ]:
data = [[175.3, 180.2, 178.6],
        [66.2, 78.9, 55.1],
        [27.0, 49.0, 35.0]]
ind = ['키', '몸무게', '나이']
col = ['홍길동','김사또','임꺽정']

df3 = pd.DataFrame(data, index = ind, columns = col)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

#### DataFrame

In [ ]:
 # 값 확인
 # 인덱스 확인
 # 컬럼 확인

print(df3.values)
print(df3.index)
print(df3.columns)

[[175.3 180.2 178.6]
 [ 66.2  78.9  55.1]
 [ 27.   49.   35. ]]
Index(['키', '몸무게', '나이'], dtype='object')
Index(['홍길동', '김사또', '임꺽정'], dtype='object')

In [ ]:
# DataFrame 열 
# 열에 먼저 접근 후, 행에 접근

display( df['2015'] )
display( df[ ['2010', '2015'] ] )
display( df[ ['2015', '2010'] ] )

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [ ]:
# "2005" 라는 컬럼명으로 2005년 인구수 대입
# data_2005 =  [9762546, 3512547, 2517680, 2456016]
# 열 단위로 작동

df['2005'] = [9762546, 3512547, 2517680, 2456016]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [ ]:
# 행 인덱스
# 슬라이싱을 했을 때는 행 단위로 작동

df[0:1]

       2015     2010     2005
서울  9904312  9631482  9762546

In [ ]:
df['서울' : '인천']

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [ ]:
df['2010']

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [ ]:
# Boolean 인덱스

df[ df["2010"] > 2500000 ]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [ ]:
# 2010년도를 기준으로 250만명을 초과하는 데이터 불러오기

df['2010'][ df['2010'] > 250000 ]

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

#### loc, iloc 인덱서

In [ ]:
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [ ]:
# loc[] - 실제 인덱스를 사용하여 행을 가지고 올 때 사용 (지정한 label을 이용하여 값을 선택)
# df.loc[행, 열]

df.loc['서울':'부산', '2015':'2010']

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [ ]:
# iloc[] - numpy의 array인덱싱 방식으로 행을 가지고 올 때 사용
# integer postion(정수형 위치 index)를 이용하여 값을 선택

df.iloc[:2, :2]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

#### csv 파일-1

population_number.csv

In [ ]:
df = pd.read_csv(drive_path + "population_number.csv", 
                 index_col='도시', encoding='euc-kr')
df

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [ ]:
# value_counts 함수
# - 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 셀 수 있다.

import numpy as np

s = pd.Series(np.random.randint(6, size = 100))
s.value_counts()
s.head(3), s.tail(3)

(0    0
 1    2
 2    0
 dtype: int64, 97    1
 98    2
 99    0
 dtype: int64)

In [ ]:
df.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [ ]:
df['2015'].value_counts()

2466052    1
2890451    1
3448737    1
9904312    1
Name: 2015, dtype: int64

In [ ]:
# 정렬
# sort_index 함수 : 인덱스 값을 기준으로 정렬한다.
# sort_values 함수 : 데이터 값을 기준으로 정렬한다.

df['2010']

도시
서울    9631482.0
부산          NaN
인천    2632035.0
대구    2431774.0
Name: 2010, dtype: float64

In [ ]:
df['2010'].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [ ]:
# DataFrame을 2010년 인구수 기준으로 정렬
# ascending = True (디폴트값, 오름차순)

df.sort_values(by = '2010', ascending = False) # ascending = False : 내림차순

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [ ]:
# DataFrame을 지역, 2010년 인구수 기준으로 정렬
# 정렬 조건을 여러개 줄 수 있다.

df.sort_values(by = ['지역', '2010'], ascending = False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

#### csv 파일-2

score.csv

In [ ]:
score = pd.read_csv(drive_path + 'score.csv', index_col = '과목', encoding = 'euc-kr')
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [ ]:
# 학급별 총계
# sum() : 열 단위로 구해진다. (축을 0을 기준으로)
# 결과는 Series로 나온다

score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
# 학급별 순위 

score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
# 과목별 총계
# 축 디폴트값 : axis = 0

score.sum(axis = 1).sort_values(ascending = False)

과목
사회    298
영어    282
국어    253
수학    201
과학    163
dtype: int64

In [ ]:
# 과목별 합계를 DataFrame에 추가

score['합계'] = score.sum(axis = 1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [ ]:
# 데이터 삭제
# del score['합계']
score.drop('합계', axis = 1, inplace = True)
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [ ]:
# 데이터에서 가장 큰 값

score.max()

1반    92
2반    92
3반    85
4반    69
dtype: int64

In [ ]:
score.max(axis = 1)

과목
수학    73
영어    92
국어    92
사회    92
과학    79
dtype: int64

In [ ]:
# 데이터에서 가장 작은 값 출력

score.min()

1반    11
2반    44
3반    45
4반    26
dtype: int64

#### Pandas 연습 03-1

과목별 평균을 계산하여 column 추가하기
```

        1반  2반	3반	4반	합계	평균
과목						
수학	45	44	73	39	201	50.25
영어	76	92	45	69	282	70.50
국어	47	92	45	69	253	63.25
사회	92	81	85	40	298	74.50
과학	11	79	47	26	163	40.75
```

In [ ]:
score['합계'] = score.sum(axis = 1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [ ]:
score.loc[:, :'4반']

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [ ]:
score['평균'] = score.loc[:, :'4반'].mean(axis = 1)
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

#### Pandas 연습 03-2

반평균을 계산 하여 row 추가 하기
```
	      1반	2반	 3반 	4반 	합계	평균
과목						
수학	45.0	44.0	73.0	39.0	201.0	50.25
영어	76.0	92.0	45.0	69.0	282.0	70.50
국어	47.0	92.0	45.0	69.0	253.0	63.25
사회	92.0	81.0	85.0	40.0	298.0	74.50
과학	11.0	79.0	47.0	26.0	163.0	40.75
반평균  54.2	77.6	59.0	48.6	239.4	59.85
```

In [ ]:
score.loc[:, :'1반']

    1반
과목
수학  45
영어  76
국어  47
사회  92
과학  11

In [ ]:
# row 추가하기

score.loc['반평균'] = score.mean()
score

       1반    2반  3반    4반     합계     평균
과목
수학     45    44  73    39    201  50.25
영어     76    92  45    69    282   70.5
국어     47    92  45    69    253  63.25
사회     92    81  85    40    298   74.5
과학     11    79  47    26    163  40.75
반평균  54.2  77.6  59  48.6  239.4  59.85

#### Pandas 연습 03-3

반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오.

```
과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64
```
```
과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64
```

In [ ]:
score.loc[:'과학', :'4반'].max(axis = 1)

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [ ]:
score.iloc[:5, :4].max(axis = 1)

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [ ]:
score.loc[:'과학', :'4반'].min(axis = 1)

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [ ]:
score.iloc[:5, :4].min(axis = 1)

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

#### Pandas 연습 03-4

과목별 가장 큰 값과 작은 값의 차를 구하시오.
```
과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64
```

#### apply 변환

행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용
```
DataFrame.apply( func, axis = 0)
```

In [ ]:
score

       1반    2반  3반    4반     합계     평균
과목
수학     45    44  73    39    201  50.25
영어     76    92  45    69    282   70.5
국어     47    92  45    69    253  63.25
사회     92    81  85    40    298   74.5
과학     11    79  47    26    163  40.75
반평균  54.2  77.6  59  48.6  239.4  59.85

In [ ]:
# 과목별 가장 큰 값과 작은 값의 차

def max_min(x) :
  return x.max() - x.min()

score.loc[:'과학', :'4반'].apply(max_min, axis = 1) # ex) 수학  73 - 39 = 34

과목
수학    34
영어    47
국어    47
사회    52
과학    68
dtype: int64

In [ ]:
# 과목별 가장 큰 값과 작은 값의 차 (lambda 활용)

score.loc[:'과학', :'4반'].apply(lambda x: x.max() - x.min(), axis = 1)

과목
수학    34
영어    47
국어    47
사회    52
과학    68
dtype: int64

In [ ]:
data_dic = {"A":[1,3,3,4,4], "B":[1,2,2,3,3], "C":[1,2,4,4,5]}
df4 = pd.DataFrame(data_dic)
df4

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [ ]:
# 카운팅 
# value_counts()
# value_counts() 메소드를 이용하면 ‘deck’ 열의 원소 종류와 개수를 알 수 있다.
# 이때 dropna=False 로 설정해야 NaN(누락데이터)의 개수를 알 수 있다.

df5 = df4.apply(pd.value_counts)
df5

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [ ]:
# 결측치 처리
# 

df5.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 카테고리

In [ ]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

cats = pd.cut(ages, bins, labels = labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [ ]:
age_df = pd.DataFrame(ages, columns=['ages'])

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [ ]:
age_df['age_cat'] = cats
age_df

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [ ]:
age_df['age_cat'].value_counts()

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: age_cat, dtype: int64

#### Pandas 연습 04-1

1. 타이타닉호 승객 데이터(train.csv)를 데이터프레임으로 읽어 온다.

2. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

```
Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64
```

In [ ]:
train = pd.read_csv(drive_path + 'train.csv', index_col='PassengerId')
train.head(3)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S

[3 rows x 11 columns]

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

#### Pandas 연습 04-2

1. 타이타닉호 승객 중 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass) 인원수, 사망/생존(Survived) 인원수를 구하라.

In [ ]:
train['Sex']

PassengerId
1        male
2      female
3      female
4      female
5        male
        ...
887      male
888    female
889    female
890      male
891      male
Name: Sex, Length: 891, dtype: object

In [ ]:
# 성별(sex)별 인원수

train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
# 나이별(age) 인원수

train['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [ ]:
# 선실별 인원수

train['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
# 사망/생존 인원수
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

#### Pandas 연습 04-3

1. 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해  ‘미성년자‘, ‘청년‘, ‘중년‘, ‘장년‘, ‘노년’ 승객의 비율을 구하라.

(단, 그룹별 비율의 전체 합은 1이 되어야 한다.)
```
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

In [ ]:
# 생존자 그룹

train_1 = train[ train['Survived'] == 1 ]
train_1

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C
...               ...     ...  ...   ...      ...
876                 1       3  ...   NaN        C
880                 1       1  ...   C50        C
881                 1       2  ...   NaN        S
888                 1       1  ...   B42        S
890                 1       1  ...  C148        C

[342 rows x 11 columns]

In [ ]:
# 생존자 그룹 카테고리화

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
train_1_cuts = pd.cut(train_1['Age'], bins, labels = labels)
train_1_cuts.value_counts()

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: Age, dtype: int64

In [ ]:
# 비율

train_1_cuts.value_counts() / train_1_cuts.count()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64

In [ ]:
# 사망자 그룹

train_2 = train[ train['Survived'] == 0 ]
train_2

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
889                 0       3  ...   NaN        S
891                 0       3  ...   NaN        Q

[549 rows x 11 columns]

In [ ]:
# 사망자 그룹 카테고리화

bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
train_2_cuts = pd.cut(train_2['Age'], bins, labels = labels)
train_2_cuts.value_counts()

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: Age, dtype: int64

In [ ]:
# 비율

train_2_cuts.value_counts() / train_2_cuts.count()

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: Age, dtype: float64

In [ ]:
train_p_s = train[ ['Pclass', 'Sex', 'Survived'] ]
train_p_s.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Survived  891 non-null    int64
dtypes: int64(2), object(1)
memory usage: 27.8+ KB

#### groupby

In [ ]:
df5 = pd.DataFrame({
    'key1':['A','A', 'B', 'B', 'A'],
    'key2':['one','two','one','two','one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [ ]:
df5[ ['key1', 'data2'] ]

  key1  data2
0    A     10
1    A     20
2    B     30
3    B     40
4    A     50

In [ ]:
g = df5[ ['key1', 'data2'] ].groupby('key1')
for x, y in g :
  print(x)
  print(y)

A
  key1  data2
0    A     10
1    A     20
4    A     50
B
  key1  data2
2    B     30
3    B     40

In [ ]:
g.sum()

      data2
key1
A        80
B        70

#### Pandas 연습 04-4

1. 선실(Pclass), 성별(Sex)로 생존자 수를 구하라.

In [ ]:
# 선실 및 성별별 생존자 수
# 사망자 = 0, 생존자 = 1 이므로 합계를 구하면 별도의 조건을 주지 않아도 됨

train[ ['Pclass', 'Sex', 'Survived'] ].groupby( ['Pclass', 'Sex'] ).sum()

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47

In [ ]:
train[ ['Pclass', 'Sex', 'Survived'] ].groupby('Sex').sum()

        Pclass  Survived
Sex
female     678       233
male      1379       109

## Pandas 요약

### 데이터프레임(Dataframe)과 시리즈(Series)

In [ ]:
# 시리즈와 데이터프레임 두 가지가 기본이다
# 자동으로 인덱스가 만들어진다

import numpy as np
import pandas as pd

In [ ]:
dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}

In [ ]:
#'year', 'city', 'temp'

In [ ]:
# index -> 'a','b','c','d','e'

In [ ]:
# columns -> '도시','연도','날씨'

In [ ]:
# index -> '도시'

### 람다 함수

In [ ]:
f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['A', 'B', 'C'], index=['a', 'b', 'c', 'd'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

### Series

In [ ]:
# 파이썬 기본 타입인  딕셔너리로부터 시리즈를 만들 수 있다
dic = {'서울':800, '부산':150, '대구': 100}
dic

{'대구': 100, '부산': 150, '서울': 800}

## 데이터 프레임 활용

In [ ]:
df = pd.read_excel(drive_path + '주가데이터.xlsx')
df

          연월일   당일종가  전일종가     시가     고가     저가     거래량
0  2018-07-02  10100   600  10850  10900  10000  137977
1  2018-06-29  10700   300  10550  10900   9990  170253
2  2018-06-28  10400   500  10900  10950  10150  155769
3  2018-06-27  10900   100  10800  11050  10500  133548
4  2018-06-26  10800   350  10900  11000  10700   63039
5  2018-06-25  11150   150  11400  11450  11000   55519
6  2018-06-22  11300   100  11250  11450  10750  134805
7  2018-06-21  11200   350  11350  11750  11200  133002
8  2018-06-20  11550   250  11200  11600  10900  308596
9  2018-06-19  11300   700  11850  11950  11300  180656
10 2018-06-18  12000  1400  13400  13400  12000  309787
11 2018-06-15  13400    50  13600  13600  12900  201376
12 2018-06-14  13450   250  13200  13700  13150  347451
13 2018-06-12  13200  1250  12200  13300  12050  558148
14 2018-06-11  11950     0  12000  12250  11950   62293
15 2018-06-08  11950     0  11950  12200  11800   59258
16 2018-06-07  11950   200  12200  12300  11900   49088
17 2018-06-05  12150   250  11800  12250  11800   42485
18 2018-06-04  11900     0  11900  12200  11700   25171
19 2018-06-01  11900   100  11800  12100  11750   32062

In [ ]:
df['연월일'].astype('str')

0     2018-07-02
1     2018-06-29
2     2018-06-28
3     2018-06-27
4     2018-06-26
5     2018-06-25
6     2018-06-22
7     2018-06-21
8     2018-06-20
9     2018-06-19
10    2018-06-18
11    2018-06-15
12    2018-06-14
13    2018-06-12
14    2018-06-11
15    2018-06-08
16    2018-06-07
17    2018-06-05
18    2018-06-04
19    2018-06-01
Name: 연월일, dtype: object

In [ ]:
df[ '연월일' ] = df['연월일'].astype('str')
df[ '연월일' ]

0     2018-07-02
1     2018-06-29
2     2018-06-28
3     2018-06-27
4     2018-06-26
5     2018-06-25
6     2018-06-22
7     2018-06-21
8     2018-06-20
9     2018-06-19
10    2018-06-18
11    2018-06-15
12    2018-06-14
13    2018-06-12
14    2018-06-11
15    2018-06-08
16    2018-06-07
17    2018-06-05
18    2018-06-04
19    2018-06-01
Name: 연월일, dtype: object

In [ ]:
# str 타입으로 변환

df[ '연월일' ].str

In [ ]:
# '-' 을 구분자로 하여 3열의 리스트로 변환

df[ '연월일' ].str.split('-')

0     [2018, 07, 02]
1     [2018, 06, 29]
2     [2018, 06, 28]
3     [2018, 06, 27]
4     [2018, 06, 26]
5     [2018, 06, 25]
6     [2018, 06, 22]
7     [2018, 06, 21]
8     [2018, 06, 20]
9     [2018, 06, 19]
10    [2018, 06, 18]
11    [2018, 06, 15]
12    [2018, 06, 14]
13    [2018, 06, 12]
14    [2018, 06, 11]
15    [2018, 06, 08]
16    [2018, 06, 07]
17    [2018, 06, 05]
18    [2018, 06, 04]
19    [2018, 06, 01]
Name: 연월일, dtype: object

In [ ]:
dates = df[ '연월일' ].str.split('-')
dates.str.get(0)

0     2018
1     2018
2     2018
3     2018
4     2018
5     2018
6     2018
7     2018
8     2018
9     2018
10    2018
11    2018
12    2018
13    2018
14    2018
15    2018
16    2018
17    2018
18    2018
19    2018
Name: 연월일, dtype: object

In [ ]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)
df.head()

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

### 데이터프레임 합치기

* concat(), merge(), join()

In [ ]:
df1 = pd.DataFrame({'a': ['a0', 'a1', 'a2', 'a3'],
                    'b': ['b0', 'b1', 'b2', 'b3'],
                    'c': ['c0', 'c1', 'c2', 'c3']},
                    index=[0, 1, 2, 3])
 
df2 = pd.DataFrame({'a': ['a2', 'a3', 'a4', 'a5'],
                    'b': ['b2', 'b3', 'b4', 'b5'],
                    'c': ['c2', 'c3', 'c4', 'c5'],
                    'd': ['d2', 'd3', 'd4', 'd5']},
                    index=[2, 3, 4, 5])

print(df1)
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

pd.concat()함수
- 데이터프레임을 말 그대로 물리적으로 이어 붙여주는 함수

In [ ]:
pd.concat( [df1, df2] )

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [ ]:
# 행 방향으로 연결

pd.concat( [df1, df2], ignore_index = True )

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [ ]:
# 열 방향으로 연결

pd.concat( [df1, df2], axis = 1)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [ ]:
# 교집합

pd.concat( [df1, df2], axis = 1, join = 'inner')

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

### 데이터프레임 병합

In [ ]:
df1 = pd.read_excel(drive_path + 'stock price.xlsx')
df2 = pd.read_excel(drive_path + 'stock valuation.xlsx')

print(df1)
print(df2)

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475
       id       name           eps     bps        per       pbr
0  130960     CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480         하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480        이마트  18268.166667  295780  13.931338  0.860437
4  145990        삼양사   5741.000000  108090  14.283226  0.758627
5  161390      한국타이어   5648.500000   51341   7.453306  0.820007
6  181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750        종근당   3990.333333   40684  25.185866  2.470259
8  204210     모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [ ]:
# 데이터 병합 (교집합으로 합쳐짐)

pd.merge(df1, df2)

       id stock_name          value  ...     bps        per       pbr
0  130960     CJ E&M   58540.666667  ...   54068  15.695091  1.829178
1  139480        이마트  239230.833333  ...  295780  13.931338  0.860437
2  145990        삼양사   82750.000000  ...  108090  14.283226  0.758627
3  185750        종근당   40293.666667  ...   40684  25.185866  2.470259
4  204210     모두투어리츠    3093.333333  ...    5335  40.802348  0.651359

[5 rows x 9 columns]

In [ ]:
# 데이터 병합 (합집합)

pd.merge(df1, df2, how = 'outer', on = 'id')

        id stock_name          value  ...       bps        per       pbr
0   128940       한미약품   59385.666667  ...       NaN        NaN       NaN
1   130960     CJ E&M   58540.666667  ...   54068.0  15.695091  1.829178
2   138250      엔에스쇼핑   14558.666667  ...       NaN        NaN       NaN
3   139480        이마트  239230.833333  ...  295780.0  13.931338  0.860437
4   142280     녹십자엠에스     468.833333  ...       NaN        NaN       NaN
5   145990        삼양사   82750.000000  ...  108090.0  14.283226  0.758627
6   185750        종근당   40293.666667  ...   40684.0  25.185866  2.470259
7   192400      쿠쿠홀딩스  179204.666667  ...       NaN        NaN       NaN
8   199800         툴젠   -2514.333333  ...       NaN        NaN       NaN
9   204210     모두투어리츠    3093.333333  ...    5335.0  40.802348  0.651359
10  136480        NaN            NaN  ...    3551.0  11.489362  0.887074
11  138040        NaN            NaN  ...   14894.0   6.313806  0.899691
12  161390        NaN            NaN  ...   51341.0   7.453306  0.820007
13  181710        NaN            NaN  ...   78434.0  30.755864  0.827447
14  207940        NaN            NaN  ...   60099.0  89.790059  6.938551

[15 rows x 9 columns]

In [ ]:
# 왼쪽 기준, 키 값 분리

pd.merge(df1, df2, how = 'left', left_on = 'stock_name', right_on = 'name')

     id_x stock_name          value  ...       bps        per       pbr
0  128940       한미약품   59385.666667  ...       NaN        NaN       NaN
1  130960     CJ E&M   58540.666667  ...   54068.0  15.695091  1.829178
2  138250      엔에스쇼핑   14558.666667  ...       NaN        NaN       NaN
3  139480        이마트  239230.833333  ...  295780.0  13.931338  0.860437
4  142280     녹십자엠에스     468.833333  ...       NaN        NaN       NaN
5  145990        삼양사   82750.000000  ...  108090.0  14.283226  0.758627
6  185750        종근당   40293.666667  ...   40684.0  25.185866  2.470259
7  192400      쿠쿠홀딩스  179204.666667  ...       NaN        NaN       NaN
8  199800         툴젠   -2514.333333  ...       NaN        NaN       NaN
9  204210     모두투어리츠    3093.333333  ...    5335.0  40.802348  0.651359

[10 rows x 10 columns]

In [ ]:
# 오른쪽 기준, 키 값 분리

pd.merge(df1, df2, how = 'right', left_on = 'stock_name', right_on = 'name')

       id_x stock_name          value  ...     bps        per       pbr
0  130960.0     CJ E&M   58540.666667  ...   54068  15.695091  1.829178
1       NaN        NaN            NaN  ...    3551  11.489362  0.887074
2       NaN        NaN            NaN  ...   14894   6.313806  0.899691
3  139480.0        이마트  239230.833333  ...  295780  13.931338  0.860437
4  145990.0        삼양사   82750.000000  ...  108090  14.283226  0.758627
5       NaN        NaN            NaN  ...   51341   7.453306  0.820007
6       NaN        NaN            NaN  ...   78434  30.755864  0.827447
7  185750.0        종근당   40293.666667  ...   40684  25.185866  2.470259
8  204210.0     모두투어리츠    3093.333333  ...    5335  40.802348  0.651359
9       NaN        NaN            NaN  ...   60099  89.790059  6.938551

[10 rows x 10 columns]

### 데이터프레임 결합 (.join)

In [ ]:
df1 = pd.read_excel(drive_path + 'stock price.xlsx', index_col = 'id')
df2 = pd.read_excel(drive_path + 'stock valuation.xlsx', index_col = 'id')

print(df1)
print(df2)

       stock_name          value   price
id
128940       한미약품   59385.666667  421000
130960     CJ E&M   58540.666667   98900
138250      엔에스쇼핑   14558.666667   13200
139480        이마트  239230.833333  254500
142280     녹십자엠에스     468.833333   10200
145990        삼양사   82750.000000   82000
185750        종근당   40293.666667  100500
192400      쿠쿠홀딩스  179204.666667  177500
199800         툴젠   -2514.333333  115400
204210     모두투어리츠    3093.333333    3475
             name           eps     bps        per       pbr
id
130960     CJ E&M   6301.333333   54068  15.695091  1.829178
136480         하림    274.166667    3551  11.489362  0.887074
138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
139480        이마트  18268.166667  295780  13.931338  0.860437
145990        삼양사   5741.000000  108090  14.283226  0.758627
161390      한국타이어   5648.500000   51341   7.453306  0.820007
181710  NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
185750        종근당   3990.333333   40684  25.185866  2.470259
204210     모두투어리츠     85.166667    5335  40.802348  0.651359
207940   삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [ ]:
# 결합(join)

df1.join(df2)

       stock_name          value   price  ...       bps        per       pbr
id                                        ...
128940       한미약품   59385.666667  421000  ...       NaN        NaN       NaN
130960     CJ E&M   58540.666667   98900  ...   54068.0  15.695091  1.829178
138250      엔에스쇼핑   14558.666667   13200  ...       NaN        NaN       NaN
139480        이마트  239230.833333  254500  ...  295780.0  13.931338  0.860437
142280     녹십자엠에스     468.833333   10200  ...       NaN        NaN       NaN
145990        삼양사   82750.000000   82000  ...  108090.0  14.283226  0.758627
185750        종근당   40293.666667  100500  ...   40684.0  25.185866  2.470259
192400      쿠쿠홀딩스  179204.666667  177500  ...       NaN        NaN       NaN
199800         툴젠   -2514.333333  115400  ...       NaN        NaN       NaN
204210     모두투어리츠    3093.333333    3475  ...    5335.0  40.802348  0.651359

[10 rows x 8 columns]

In [ ]:
# 교집합

df1.join(df2, how = 'inner')

       stock_name          value   price  ...     bps        per       pbr
id                                        ...
130960     CJ E&M   58540.666667   98900  ...   54068  15.695091  1.829178
139480        이마트  239230.833333  254500  ...  295780  13.931338  0.860437
145990        삼양사   82750.000000   82000  ...  108090  14.283226  0.758627
185750        종근당   40293.666667  100500  ...   40684  25.185866  2.470259
204210     모두투어리츠    3093.333333    3475  ...    5335  40.802348  0.651359

[5 rows x 8 columns]

### 멀티인덱스

In [ ]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [ ]:
# survived, sex, age, fare, class
# 클래스와 성별로 그룹을 지어 합계 구하기

titanic[ ['survived', 'sex', 'age', 'fare', 'class'] ].groupby( ['sex', 'class'] ).sum()

               survived      age       fare
sex    class
female First         91  2942.00  9975.8250
       Second        70  2125.50  1669.7292
       Third         72  2218.50  2321.1086
male   First         45  4169.42  8201.5875
       Second        17  3043.33  2132.1125
       Third         47  6706.42  4393.5865

In [ ]:
df = titanic[ ['age', 'sex', 'class', 'fare', 'survived'] ]
df_g = df.groupby( ['class', 'sex'] )
df_g.sum()

                   age       fare  survived
class  sex
First  female  2942.00  9975.8250        91
       male    4169.42  8201.5875        45
Second female  2125.50  1669.7292        70
       male    3043.33  2132.1125        17
Third  female  2218.50  2321.1086        72
       male    6706.42  4393.5865        47

In [ ]:
df_g.mean().loc[ ('First', 'female') ]

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [ ]:
df_g.mean().xs('male', level = 'sex')

              age       fare  survived
class
First   41.281386  67.226127  0.368852
Second  30.740707  19.741782  0.157407
Third   26.507589  12.661633  0.135447

## 데이터 사전 처리

### 결측치(누락 데이터) 처리

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [ ]:
df['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [ ]:
df.head().isnull()

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False

[5 rows x 15 columns]

In [ ]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

누락 데이터 제거

In [ ]:
df_rc = pd.DataFrame({'name':['kim', 'lee', 'park'],
                      'age':[10, 20, 30],
                      'height':[170, 160, 180]})
df_rc.drop([0, 1], axis=0)
df_rc.drop(['name'], axis=1)

   age  height
0   10     170
1   20     160
2   30     180

In [ ]:
# 데이터가 500개 이상 있는 경우를 제외하고는 삭제
df.dropna(axis=1, thresh=500).head(3)

   survived  pclass     sex   age  ...  adult_male  embark_town  alive  alone
0         0       3    male  22.0  ...        True  Southampton     no  False
1         1       1  female  38.0  ...       False    Cherbourg    yes  False
2         1       3  female  26.0  ...       False  Southampton    yes   True

[3 rows x 14 columns]

누락 데이터 치환

In [ ]:
# 평균으로 누락 데이터 치환
df['age'].value_counts(dropna=False)

age_mean = df['age'].mean()
df['age'].fillna(age_mean, inplace=True)

df['age'].value_counts(dropna=False)

29.699118    177
24.000000     30
22.000000     27
18.000000     26
28.000000     25
            ...
55.500000      1
53.000000      1
20.500000      1
23.500000      1
0.420000       1
Name: age, Length: 89, dtype: int64

In [ ]:
# 빈도수로 누락 데이터 치환
embark_town_idxmax = df['embark_town'].value_counts().idxmax()
df['embark_town'].fillna(embark_town_idxmax, inplace=True)
df.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      0
alive            0
alone            0
dtype: int64

In [ ]:
# 이웃하는 값으로 치환
df['embarked'].fillna(method='ffill', inplace=True)
df.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           688
embark_town      0
alive            0
alone            0
dtype: int64

### 중복 데이터 처리

In [ ]:
# 중복 데이터 확인
df_dup = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                       'c2':[1, 1, 1, 2, 2],
                       'c3':[1, 1, 2, 2, 2]})
df_dup.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:
# 중복 데이터 제거
df_dup.drop_duplicates(inplace=True)
df_dup

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

### 데이터 표준화

- 데이터 포맷을 일관성 있게 표준화

In [ ]:
# 단위환산 -> 단위통일
# mpg(mile per galion) -> kpl(killometer per liter)
mpg_to_kpl = 1.60934 / 3.78541
mpg_to_kpl

df['age'].round(2)

In [ ]:
# 자료형 변환

### 범주형(카테고리) 데이터 처리

구간 분할
 - 연속 데이터를 그대로 사용하지 않고 일정 구간(bin)으로 나눠서 분석 -> 효율적일 경우

원핫인코딩
 - 번주형 데이터를 0과 1로만 구성된 것으로 변환(원핫벡터)

### 정규화

- 숫자 데이터의 상대적인 크기 차이를 제거

In [ ]:
df = sns.load_dataset('mpg')
df['horsepower'] / abs( df['horsepower'].max() )

0      0.565217
1      0.717391
2      0.652174
3      0.652174
4      0.608696
         ...
393    0.373913
394    0.226087
395    0.365217
396    0.343478
397    0.356522
Name: horsepower, Length: 398, dtype: float64

In [ ]:
min_x = df['horsepower'] - df['horsepower'].min()
min_x.max()

184.0

## 판다스 시계열 데이터 처리

- 판다스 시간 표시 유형
  1. Timestamp : 특정한 시점을 기록
  2. Peroid : 두 시점 사이의 일정한 기간을 표시